const quizData = [
  {
    question:
      "1. استراتيجية تعتمد على النظرية البنائية حيث تقوم على الافتراض الأساسي وهو أن الطالب يبني المعرفة بنفسه عن طريق التفاعل بين المعلومات الجديدة والخبرة السابقة الموجودة في الذاكرة هي استراتيجية......",
    answers: [
      "بناء المعنى KWL",
      "التدريس المباشر",
      "الإكتشاف الحر",
      "المناقشة",
    ],
    answer: 0,
  },
  {
    question:
      "2. من الخطوات الإجرائية لإستراتيجية ......... أن يتحقق الطالب من صحة القاعدة أو العلاقات بالنسبة لحالات أخرى مماثلة",
    answers: [
      "الإكتشاف",
      "الإكتشاف الإستقرائي",
      "الإكتشاف الإستنباطي",
      "الإكتشاف الموجه",
    ],
    answer: 0,
  },
  {
    question:
      "3. تمثل ........ المحور الأساسي لاستراتيجية التعلم القائم على المشكلة ومن ثم نجاح هذا النوع من التعلم رهين بالاختبار الجيد والدقيق لهذه المهام من قبل الطلاب",
    answers: [
      "مهام التعلم",
      "المجموعات التعاونية",
      "المشاركة",
      "تحليل المشكلة",
    ],
    answer: 0,
  },
  {
    question:
      "4. أحد أسس العصف الذهني .......",
    answers: [
      "تقديم الأفكار",
      "البناء على أفكار الآخرين",
      "حل المشكلات حلا إبداعيا",
      "إيجاد مشكلات أو مشاريع جديدة",
    ],
    answer: 1,
  },
  {
    question:
      "5. من مراحل الإكتشاف الإستقرائي مرحلة ........",
    answers: [
      "صياغة الفروض",
      "إختبار صحة الفروض",
      "تقديم المشكلة",
      "اختبار صحة التعميم",
    ],
    answer: 3,
  },
  {
    question:
      "6. من عناصر بيئة التعلم النشط ........",
    answers: [
      "المناهج المبتكرة",
      "الأنشطة الفصلية",
      "آراء المعلمين",
      "التقويم الشامل",
    ],
    answer: 1,
  },
  {
    question:
      "7. مرحلة ...... يقوم الطالب بالتفكير في كل ما يريد أن يعرفه عن موضوع أو ما يتوقع أن يتعلمه عن الموضوع",
    answers: [
      "ما أعرفه؟",
      "ما أريد أن أعرفه؟",
      "ما تعلمته بالفعل؟",
      "ما أتوقع أن أعرفه؟",
    ],
    answer: 1,
  },
  {
    question:
      "8. أحد مبادئ التعلم النشط الخاصة بالمعلم ........",
    answers: [
      "التفاعل الإيجابي في الموقف التعليمي",
      "ممارسة المهام التعليمية في مستوى قدراته",
      "مراعاة الفروق الفردية وأنماط التعلم للطلاب",
      "الإستعداد والإهتمام أثناء التعلم النشط",
    ],
    answer: 2,
  },
  {
    question:
      "9. نوع من الأسئلة لا يحتمل الجواب الصحيح الواحد حيث يؤدي ذلك إلى تثبيت مهارات التفكير هي الأسئلة ........",
    answers: [
      "المفتوحة",
      "المفتوحة/المغلقة",
      "المغلقة",
      "المغلقة/المفتوحة",
    ],
    answer: 1,
  },
  {
    question:
      "10. يتم في مرحلة التخطيط في استراتيجية التعلم التعاوني .......",
    answers: [
      "تقديم المهام",
      "المراقبة والتدخل",
      "تكوين الاعتماد المتبادل",
      "تكوين المجموعات",
    ],
    answer: 0,
  },
  {
    question:
      "11. مجموعة من الأداءات تتعلق بالأسئلة وتلقي إجابات الطلاب ومن ثم التعليق عليها وتوضيحها لكي تتحقق المشاركة النشطة من قبلهم ولمساعدتهم على التفكير في خطوات الحل وتنفيذه هي تحركات ..........",
    answers: [
      "التمهيد للدرس",
      "المناقشة",
      "العرض",
      "الاكتشاف",
    ],
    answer: 1,
  },
  {
    question:
      "12. يقصد به الحرص على الحصول على أكبر قدر ممكن من الأفكار مهما كانت جودتها وأهميتها حيث إن الأفكار غير واقعية قد تثير أفكارا أفضل لدى الآخرين هي ..........",
    answers: [
      "إرجاء التقويم والنقد",
      "إطلاق حرية التفكير",
      "الكم قبل الكيف",
      "الترحيب بكل الأفكار",
    ],
    answer: 2,
  },
  {
    question:
      "13. عند مرحلة ........ يقوم المعلم بتهيئة الطلاب للمشاركة من خلال إثارة دافعيتهم للتعلم وتشجيعهم",
    answers: [
      "التمهيد",
      "متابعة المناقشة",
      "بدء المناقشة",
      "انتهاء المناقشة",
    ],
    answer: 0,
  },
  {
    question:
      "14. الأنشطة ......... يجب أن تكون ممثلة للمهام والمشكلات التي سيمر بها الطالب في المستقبل",
    answers: [
      "الصلبة",
      "الأصيلة",
      "العلمية",
      "الترفيهية",
    ],
    answer: 0,
  },
  {
    question:
      "15. تعرف المهارات ........ بأنها القدرة على التفاعل والحوار مع الطلاب وتنسيق الجهود بينهم، وخلق روح العمل التعاوني والإيجابي الفعال بينهم، ومراعاة الفروق الفردية بينهم",
    answers: [
      "الذاتية",
      "الفنية",
      "الإنسانية",
      "الشخصية",
    ],
    answer: 1,
  },
  {
    question:
      "16. من خطوات استراتيجية التعلم القائم على المشكلة ...........",
    answers: [
      "إقامة تفاعلات مع الفريق",
      "الفهم والتطبيق",
      "التشخيص والتقويم",
      "التعزيز الإيجابي والسلبي",
    ],
    answer: 0,
  },
  {
    question:
      "17. خطوة من استراتيجية العصف الذهني يتم فيها إعادة صياغة المشكلة لتزداد وضوحا، وبالتالي يتم تقديم حلول مقبولة لحل المشكلة، واستبعاد الحلول التي لا تقود إلى الحل هي .........",
    answers: [
      "تقديم الأفكار",
      "بلورة المشكلة",
      "يطرح حلولا للمشكلة",
      "يبني أفكار زملائه",
    ],
    answer: 1,
  },
  {
    question:
      "18. مناقشة المعلم لطلاب في ناتج التعلم وتقديم بعض الأسئلة للتأكد من تعلمهم لناتج التعلم المطلوب للوقوف على نقاط القوة والضعف لديهم يتم في مرحلة ..........",
    answers: [
      "العرض",
      "الغلق",
      "التقويم",
      "التلخيص",
    ],
    answer: 2,
  },
  {
    question:
      "1. المناقشة المقيدة هي التي تدور حول موضوع عام أو مشكلة تواجه الطلاب في حياتهم",
    answers: [
      "صح",
      "غلط",
    ],
    answer: 1,
  },
  {
    question:
      "2. يراعي في تقسيم المجموعات في استراتيجية التعلم التعاوني أن المجموعات تكون غير متجانسة",
    answers: [
      "صح",
      "غلط",
    ],
    answer: 0,
  },
  {
    question:
      "3. المعلم النشط يسيطر على عملية التعلم ويقوم بالعمل بدافع ذاتي ويتعلم ما يرغب في تعلمه",
    answers: [
      "صح",
      "غلط",
    ],
    answer: 0,
  },
  {
    question:
      "4. من مواصفات الأنشطة أن تكون محصورة في غرفة الصف الدراسي",
    answers: [
      "صح",
      "غلط",
    ],
    answer: 0,
  },
  {
    question:
      "5. يناقش المعلم طلابه في المعلومات والخبرات التي تعلموها ومعرفة المعلومات والخبرات التي لم تصل إليهم في اجراءات تنفيذ استراتيجية بناء المعنى KWL",
    answers: [
      "صح",
      "غلط",
    ],
    answer: 1,
  },
  {
    question:
      "6. الأهداف التعليمية في التعلم النشط معلنة للطلاب ويشاركون في صياغتها وتغطيتها",
    answers: [
      "صح",
      "غلط",
    ],
    answer: 0,
  },
  {
    question:
      "7. مرحلة التقويم تعمل على تنويع الخبرات التي تؤدي إلى زيادة الخبرة بالتدرج حالة تتأكد من أن الطالب قد وصل إلى المستوى المناسب أو المقبول من الأداء",
    answers: [
      "صح",
      "غلط",
    ],
    answer: 0,
  },
  {
    question:
      "8. أحد النتائج الإيجابية لبيئة التعلم النشط هي تنمية مهارات التفكير العليا",
    answers: [
      "صح",
      "غلط",
    ],
    answer: 0,
  },
  {
    question:
      "9. مقرر المجموعة هو المسئول عن قيادة وتوجيه وضبط أفراد المجموعة نحو المهمة وإنجاز الهدف المنشود",
    answers: [
      "صح",
      "غلط",
    ],
    answer: 0,
  },
  // مقالي
  // {
  //   question:
  //     "1. ",
  //   answer_path: "assests/1.jpg",
  // },
  // Add more questions here...
];