const quizData = [
  {
    question:
      "1. جميع ما يأتي يمثل أهمية تطبيقية لعلم نفس النمو ما عدا .........",
    answers: [
      "معرفة السلوك الشاذ",
      "وضع مناهج دراسية ملائمة",
      "التنبؤ والتحكم في ظاهرة النمو",
      "بناء المعرفة عن ظاهرة النمو الانساني",
    ],
    answer: 1,
  },
  {
    question:
      "1. ",
    answers: [
      "",
      "",
      "",
      "",
    ],
    answer: 1,
  },
  {
    question:
      "1. ",
    answers: [
      "",
      "",
      "",
      "",
    ],
    answer: 1,
  },
  // Add more questions here...
];